#Pointer 

- คือรูปแบบของตัวแปรแบบนึง 
- Pointer ไม่ได้เก็บตัวเลขจำนวนเต็มหรือ ทศนิยมอะไรเลย มันมีหน้าที่เก็บ Address
- ที่อยู่ หรือ Address ของตัวแปร ถ้าให้เปรียบก็น่าจะเหมือนกับ ที่อยู่บ้านของเรา แต่นี่เป็นที่อยู่ใน Memory ของเครื่อง วิธีเรียก Address นั่นก็คือใช้ Address Operator (&) ที่เราได้ใช้ไปแล้วตอน scanf()
- ค่า หรือ Value อันนี้คือสิ่งที่เราเรียกมันมาใช้นั่นแหละ เหมือนเราบอกว่า a = 20; 20 นั่นคือค่าของ a 
- Pointer เองนอกจากที่มันจะเก็บ Address ของคนอื่นตามที่เราต้องการแล้ว มันก็ยังมี Address เป็นของตัวเอง


#การสร้าง Pointer
- วิธีการสร้าง Pointer เราจะใช้เครื่องหมายดอกจัน ตอนเราสร้างตัวแแปร เพื่อบ่งบอกว่ามันคือ Pointer
        int a = 20;
        int ptr_a = &a;
    จากตัวอย่างด้านบน บรรทัดแรก เราสร้างตัวแปร a ให้ค่ามันเป็น 20 
    บรรทัดถัดมา คือ Pointer เราสร้าง Pointer ชื่อ ptr_a ขึ้นมา 
    ให้ค่ามันเป็น Address ของตัวแปร a โดยใช้ Address Operator

        int a = 20;
        int *ptr_a = &a;
        int **ptrOfptr_a = &ptr_a;
    จากตัวอย่างด้านบนนี้ เรามีตัวแปร a ที่มีค่าเป็น 20 
    สร้าง Pointer ขึ้นมาใหม่ ชื่อ ptr_a เพื่อเก็บค่า Address ของ a 
    สร้าง Pointer ชื่อ ptrOfptr_a ขึ้นมาเพื่อเก็บ Address ของ ptr_a อีกรอบนึง


#การทำงานกับ Pointer เบื้องต้น

    #include <stdio.h>

    int main ()
    {
        int a = 20;
        int *ptr_a = &a;

        printf("%p"ptr_a);
        printf("%d",*ptr_a);

        return 0;
    }
